; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=168, out_folder=./training, instance_id=16, seed=2040, goal_proportion=0.03

(define (problem blocksworld-16)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 - object)
 (:init 
    (arm-empty)
    (clear b76)
    (on b76 b53)
    (on b53 b36)
    (on b36 b93)
    (on b93 b67)
    (on b67 b89)
    (on b89 b109)
    (on b109 b71)
    (on b71 b130)
    (on-table b130)
    (clear b40)
    (on b40 b106)
    (on b106 b101)
    (on b101 b120)
    (on b120 b129)
    (on-table b129)
    (clear b52)
    (on b52 b48)
    (on-table b48)
    (clear b32)
    (on-table b32)
    (clear b63)
    (on b63 b145)
    (on b145 b19)
    (on-table b19)
    (clear b166)
    (on-table b166)
    (clear b62)
    (on b62 b133)
    (on b133 b123)
    (on b123 b162)
    (on b162 b28)
    (on b28 b46)
    (on b46 b65)
    (on b65 b116)
    (on b116 b6)
    (on b6 b141)
    (on b141 b103)
    (on b103 b73)
    (on-table b73)
    (clear b87)
    (on b87 b127)
    (on b127 b37)
    (on b37 b57)
    (on b57 b157)
    (on-table b157)
    (clear b18)
    (on-table b18)
    (clear b81)
    (on-table b81)
    (clear b122)
    (on b122 b102)
    (on b102 b5)
    (on b5 b167)
    (on b167 b150)
    (on b150 b88)
    (on b88 b31)
    (on-table b31)
    (clear b115)
    (on-table b115)
    (clear b165)
    (on b165 b164)
    (on b164 b168)
    (on b168 b117)
    (on b117 b16)
    (on b16 b34)
    (on b34 b134)
    (on b134 b78)
    (on b78 b80)
    (on b80 b160)
    (on-table b160)
    (clear b142)
    (on b142 b54)
    (on-table b54)
    (clear b149)
    (on b149 b69)
    (on b69 b126)
    (on b126 b2)
    (on b2 b135)
    (on b135 b99)
    (on b99 b153)
    (on b153 b108)
    (on-table b108)
    (clear b49)
    (on b49 b27)
    (on-table b27)
    (clear b22)
    (on b22 b100)
    (on b100 b45)
    (on b45 b20)
    (on-table b20)
    (clear b152)
    (on b152 b155)
    (on-table b155)
    (clear b58)
    (on b58 b47)
    (on b47 b82)
    (on b82 b104)
    (on b104 b9)
    (on b9 b148)
    (on b148 b163)
    (on-table b163)
    (clear b113)
    (on b113 b50)
    (on b50 b35)
    (on b35 b25)
    (on-table b25)
    (clear b114)
    (on b114 b96)
    (on b96 b97)
    (on-table b97)
    (clear b4)
    (on b4 b159)
    (on-table b159)
    (clear b132)
    (on b132 b17)
    (on b17 b110)
    (on-table b110)
    (clear b26)
    (on b26 b38)
    (on b38 b30)
    (on b30 b94)
    (on-table b94)
    (clear b140)
    (on b140 b139)
    (on b139 b29)
    (on b29 b70)
    (on b70 b60)
    (on b60 b111)
    (on b111 b112)
    (on b112 b10)
    (on b10 b14)
    (on b14 b84)
    (on-table b84)
    (clear b56)
    (on b56 b86)
    (on b86 b75)
    (on b75 b72)
    (on-table b72)
    (clear b39)
    (on b39 b61)
    (on b61 b8)
    (on-table b8)
    (clear b66)
    (on b66 b146)
    (on b146 b51)
    (on b51 b156)
    (on b156 b119)
    (on-table b119)
    (clear b121)
    (on b121 b77)
    (on-table b77)
    (clear b33)
    (on-table b33)
    (clear b136)
    (on b136 b161)
    (on b161 b124)
    (on b124 b55)
    (on-table b55)
    (clear b79)
    (on b79 b92)
    (on b92 b137)
    (on b137 b107)
    (on b107 b15)
    (on b15 b138)
    (on b138 b74)
    (on b74 b64)
    (on b64 b158)
    (on b158 b23)
    (on b23 b13)
    (on-table b13)
    (clear b7)
    (on-table b7)
    (clear b42)
    (on-table b42)
    (clear b154)
    (on-table b154)
    (clear b144)
    (on b144 b68)
    (on-table b68)
    (clear b3)
    (on b3 b1)
    (on b1 b44)
    (on b44 b83)
    (on-table b83)
    (clear b21)
    (on b21 b151)
    (on b151 b91)
    (on b91 b95)
    (on b95 b24)
    (on b24 b118)
    (on-table b118)
    (clear b59)
    (on b59 b12)
    (on b12 b11)
    (on b11 b43)
    (on b43 b41)
    (on-table b41)
    (clear b90)
    (on b90 b131)
    (on b131 b105)
    (on b105 b125)
    (on b125 b128)
    (on b128 b147)
    (on b147 b85)
    (on-table b85)
    (clear b143)
    (on b143 b98)
    (on-table b98))
 (:goal  (and 
    (clear b3)
    (on b3 b2)
    (on-table b2)
    (clear b5)
    (on b5 b1)
    (on-table b1)
    (clear b4)
    (on-table b4))))

; plan
1. (unstack b4 b159)
   deleted: (on b4 b159) (clear b4) (arm-empty)
   added: (holding b4) (clear b159)
   goals met: 1 of 8
2. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 3 of 8
3. (unstack b122 b102)
   deleted: (on b122 b102) (clear b122) (arm-empty)
   added: (holding b122) (clear b102)
   goals met: 3 of 8
4. (putdown b122)
   deleted: (holding b122)
   added: (clear b122) (arm-empty) (on-table b122)
   goals met: 3 of 8
5. (unstack b102 b5)
   deleted: (on b102 b5) (clear b102) (arm-empty)
   added: (holding b102) (clear b5)
   goals met: 4 of 8
6. (putdown b102)
   deleted: (holding b102)
   added: (clear b102) (arm-empty) (on-table b102)
   goals met: 4 of 8
7. (unstack b149 b69)
   deleted: (on b149 b69) (clear b149) (arm-empty)
   added: (holding b149) (clear b69)
   goals met: 4 of 8
8. (putdown b149)
   deleted: (holding b149)
   added: (clear b149) (arm-empty) (on-table b149)
   goals met: 4 of 8
9. (unstack b69 b126)
   deleted: (on b69 b126) (clear b69) (arm-empty)
   added: (holding b69) (clear b126)
   goals met: 4 of 8
10. (putdown b69)
   deleted: (holding b69)
   added: (clear b69) (arm-empty) (on-table b69)
   goals met: 4 of 8
11. (unstack b126 b2)
   deleted: (on b126 b2) (clear b126) (arm-empty)
   added: (holding b126) (clear b2)
   goals met: 4 of 8
12. (putdown b126)
   deleted: (holding b126)
   added: (clear b126) (arm-empty) (on-table b126)
   goals met: 4 of 8
13. (unstack b2 b135)
   deleted: (on b2 b135) (clear b2) (arm-empty)
   added: (holding b2) (clear b135)
   goals met: 4 of 8
14. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 5 of 8
15. (unstack b3 b1)
   deleted: (on b3 b1) (clear b3) (arm-empty)
   added: (holding b3) (clear b1)
   goals met: 4 of 8
16. (stack b3 b2)
   deleted: (clear b2) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b2)
   goals met: 6 of 8
17. (unstack b1 b44)
   deleted: (on b1 b44) (clear b1) (arm-empty)
   added: (holding b1) (clear b44)
   goals met: 6 of 8
18. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 7 of 8
19. (unstack b5 b167)
   deleted: (on b5 b167) (clear b5) (arm-empty)
   added: (holding b5) (clear b167)
   goals met: 6 of 8
20. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 8 of 8
